{"publish":{"publish_pages_app":true,"publish_sha":"","publish_iso_date":""},"users":[],"project":{"github_org":"naponigore","is_private":false,"title":"Monster Mash ABC for Kids Video","description":"The ABC For Kids Video Hits version of Monster Mash, performed by Ross Higgins, is a lively and entertaining children's music video with a fun Halloween theme. The video features a mix of live-action and animation, creating a spooky yet playful atmosphere suitable for young audiences. With a color palette of purples, greens, and oranges, the visuals emphasize classic Halloween imagery such as dancing skeletons, friendly monsters, and eerie castles. Ross Higgins performs animated vocals, bringing humor and theatricality to the song. Various characters, possibly puppets or cartoon figures, join in the fun, lip-syncing and dancing to the beat. Sound effects like creaking doors and ghostly howls enhance the eerie yet amusing ambiance. As the song builds towards the finale, the energy peaks with all the characters joining in for a final dance. The video concludes with a fade-out or a humorous ending, leaving viewers with a sense of fun and nostalgia.","language":"en","slug":"ABC","creator":"naponigore","authors":"Naponi Gore","media_player":"avannotate","auto_populate_home_page":true,"additional_users":[],"tags":{"tagGroups":[{"category":"Introduction","color":"#ADFFD9"},{"category":"Ross Higgins | Verse 1","color":"#ADFEFF"},{"category":"Lyrics | Chorus","color":"#99E6FF"},{"category":"Ross Higgins | Setting","color":"#88C9F2"},{"category":"Setting","color":"#99AFF2"},{"category":"Lyrics | Verse 2","color":"#B3B3E6"},{"category":"Transition | Setting","color":"#C195DB"},{"category":"Ross Higgins","color":"#DA9ECF"},{"category":"Lyrics | Verse 3","color":"#F2A7C3"},{"category":"Outro | Transition","color":"#DC8F8D"},{"category":"_uncategorized_","color":"#A3A3A3"}],"tags":[{"tag":"Bubbly sound effects followed by upbeat music. The lighting on set is very dim and soft, melancholic parody","category":"Introduction"},{"tag":"\"I was working in the lab one night, when my eyes beheld an eerie sight. For my monster from his nap began to rise, and suddenly, to my suprise,\" Ross Higgins sings with expressive vocals.","category":"Ross Higgins | Verse 1"},{"tag":"\"He did the mash! He did the monster mash. The monster mash! It was a graveyard smash. He did the mash! He caught on in a flash. He did the mash! He did the monster mash\"","category":"Lyrics | Chorus"},{"tag":"The mood of the music video is very humorous as kids are dressed up as the classic monsters and Ross Higgins impersonating a scientist. Background visuals have cartoonish monsters, skeletons, and halloween decor.","category":"Ross Higgins | Setting"},{"tag":"The color scheme is pastel, giving a nostalgic feel","category":"Setting"},{"tag":"\"The Zombies were having fun. The party had just begun. The guest included the Wolfman, Dracula, and his son.\"","category":"Lyrics | Verse 2"},{"tag":"There is a choreographed part performed by kids. There are a lot of fade-in and crossfade camera transitions.","category":"Transition | Setting"},{"tag":"\"What ever happened to my Transylvanian twist?\" Ross Higgins impersonated Dracula with a strong Transylvanian accent while the kid mouths the lyrics. The kids' interaction with the \"spooky \" environment makes the video humorous.","category":"Ross Higgins"},{"tag":"The kids dance to the chorus, and they are dressed in Halloween colors:  purple, greens, orange, black, grey.","category":"Setting"},{"tag":"\"Now everything's cool, tracks of the band, and my monster mash is the hit of the land. For you, the living, this mash was made too. When you get to my door, tell them Boris sent you.\"","category":"Lyrics | Verse 3"},{"tag":"The song ends with an abrupt cut to the ABC for Kids logo.","category":"Outro | Transition"},{"category":"_uncategorized_","tag":"Introduction"},{"category":"_uncategorized_","tag":"Ross Higgins"}]},"created_at":"2025-03-06T23:18:50.943Z","updated_at":"2025-03-06T23:21:39.668Z"}}